EJERCICIOS BASICOS PYTHON

15/08/22

Tipos de datos

In [1]:
tupla_1= (1,2,3,4, "carlos", "c", "g")
lista_1= [1,2,3,4, "lucia"]
cadena_1= "soy una cadena creada por Carlos"

print (type(tupla_1))
print (type (lista_1))
print (type (cadena_1))

<class 'tuple'>
<class 'list'>
<class 'str'>

In [2]:
texto_1= "soy un texto"
entero_1=100
decimal_1=5.565656
booleano_1= False

print (type(texto_1))
print (type (entero_1))
print (type (decimal_1))
print (type(booleano_1))

<class 'str'>
<class 'int'>
<class 'float'>
<class 'bool'>

In [3]:
entrada_1=input("-->")
texto_1= "mi DNI es:"

print (texto_1+entrada_1)

-->53197355B
mi DNI es:53197355B

Operaciones aritmeticas

In [6]:
a= 2+7
b=5**2
c=26/4
d=33%5
e=b//c

print (a)
print (b)
print (c)
print (d)
print (e)

9
25
6.5
3
3.0

In [9]:
b=15

print (a==b)
print (a!=b)
print (c<b)
print (c>b)

False
True
True
False

In [10]:
a<b and b<c

False

In [11]:
a>b or b<c

False

In [12]:
a<b or b<c

True

In [13]:
print (tupla_1[1])
print (tupla_1[3])
print (tupla_1[0])
print (tupla_1[4])
print (lista_1[1])
print (lista_1[3])

2
4
1
carlos
2
4

Selección y cambio de valores en una lista

In [14]:
lista_1[3]="genial"

print (lista_1[3])

genial

In [16]:
lista_1[1]="si, joder"

print (lista_1)
print (lista_1[1])

[1, 'si, joder', 3, 'genial', 'lucia']
si, joder

In [20]:
tupla_1=(list(tupla_1))

tupla_1[4]="Carlos Vila"

print (tupla_1[4])

Carlos Vila

In [21]:
cadena_1= (list(cadena_1))

cadena_1[3]="u"

print (cadena_1[3])
print (cadena_1)

u
['s', 'o', 'y', 'u', 'u', 'n', 'a', ' ', 'c', 'a', 'd', 'e', 'n', 'a', ' ', 'c', 'r', 'e', 'a', 'd', 'a', ' ', 'p', 'o', 'r', ' ', 'C', 'a', 'r', 'l', 'o', 's']

In [22]:
secuencia_1= tupla_1+lista_1
print (secuencia_1)

[1, 2, 3, 4, 'Carlos Vila', 'c', 'g', 1, 'si, joder', 3, 'genial', 'lucia']

In [23]:
secuencia_1*2

[1,
 2,
 3,
 4,
 'Carlos Vila',
 'c',
 'g',
 1,
 'si, joder',
 3,
 'genial',
 'lucia',
 1,
 2,
 3,
 4,
 'Carlos Vila',
 'c',
 'g',
 1,
 'si, joder',
 3,
 'genial',
 'lucia']

In [24]:
secuencia_2=secuencia_1*2

print (secuencia_2)

[1, 2, 3, 4, 'Carlos Vila', 'c', 'g', 1, 'si, joder', 3, 'genial', 'lucia', 1, 2, 3, 4, 'Carlos Vila', 'c', 'g', 1, 'si, joder', 3, 'genial', 'lucia']

In [25]:
print (6 in tupla_1)
print ("Carlos Vila" in secuencia_2)
print ("lucia" in tupla_1)
print ("d" in cadena_1)

False
True
False
True

In [28]:
print (secuencia_2[2::2])

[3, 'Carlos Vila', 'g', 'si, joder', 'genial', 1, 3, 'Carlos Vila', 'g', 'si, joder', 'genial']

In [29]:
print (tupla_1[::-1])

['g', 'c', 'Carlos Vila', 4, 3, 2, 1]

In [30]:
print (len(tupla_1))

7

In [35]:
print (tupla_1.index(3))

2

In [36]:
lista_2= 1,1,1,3,3,4,4,4,4,4,7,7

print (lista_2.count(1))
print (lista_2.count(3))
print (lista_2.count(4))
print (lista_2.count(7))

3
2
5
2

In [37]:
lista_3= "carlos", "sergio", "dani", "pol"

el1,el2,el3,el4= lista_3

print (el1)
print (el2)
print (el3)
print (el4)

carlos
sergio
dani
pol

In [42]:
lista_4= 1,2,3,4

lista_5=(zip(lista_3,lista_4))
print (list(lista_5))

[('carlos', 1), ('sergio', 2), ('dani', 3), ('pol', 4)]

In [47]:
lista1= (range(5,20,3))

print (lista1)
print (list(lista1))

range(5, 20, 3)
[5, 8, 11, 14, 17]

In [51]:
lista2=(range(10))
print (type(lista2))

<class 'range'>

In [54]:
lista2= (list(lista2))
print (lista2)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [58]:
lista2.append("carlos")

lista2.insert(3,"lucia")

print (lista2)

[0, 1, 2, 'lucia', 3, 4, 5, 6, 7, 8, 9, 'carlos', 'carlos', 'carlos']

Diccionarios

In [1]:
dicc={"nombre":"carlos", "apellido":"vila", "pais": "españa", "DIN":"53197355B"}
dicc

{'nombre': 'carlos', 'apellido': 'vila', 'pais': 'españa', 'DIN': '53197355B'}

In [2]:
dicc.keys()

dict_keys(['nombre', 'apellido', 'pais', 'DIN'])

In [3]:
dicc.values()

dict_values(['carlos', 'vila', 'españa', '53197355B'])

In [8]:
dicc["sexo"]="hombre"
dicc

{'nombre': 'carlos',
 'apellido': 'vila',
 'pais': 'españa',
 'DIN': '53197355B',
 'sexo': 'hombre'}

In [11]:
dicc.update({"pais":"cataluñá"})
dicc

{'nombre': 'carlos',
 'apellido': 'vila',
 'pais': 'cataluñá',
 'DIN': '53197355B',
 'sexo': 'hombre'}

Conjuntos

In [13]:
conj= {1,2,3,4,5,6}
conj

{1, 2, 3, 4, 5, 6}

In [17]:
conj2={4,5,6,7,8,9}
print (conj-conj2)
print (conj2-conj)
print (conj|conj2)
print (conj&conj2)
print (conj^conj2)

{1, 2, 3}
{8, 9, 7}
{1, 2, 3, 4, 5, 6, 7, 8, 9}
{4, 5, 6}
{1, 2, 3, 7, 8, 9}

In [19]:
print (2 in conj)
print (2 in conj2)

True
False

In [24]:
conj3=conj|conj2
print (conj>=conj3)
print (conj<=conj3)
print (conj>=conj2)

False
True
False

In [25]:
conj.remove(2)
conj

{1, 3, 4, 5, 6}

In [27]:
conj2.remove(7)
conj2

{4, 5, 6, 8, 9}

condicionantes (if, elif,else)

In [29]:
edadc=30
edadl=34

if edadc<edadl:
    print("lucia es mayor")

lucia es mayor

In [30]:
if edadc>edadl:
    print("lucia es mayor")

else:
    print ("carlos es menor")

carlos es menor

In [32]:
if edadc>edadl:
    print("lucia es mayor")

elif edadl<35:
    print ("lucia es mayor pero no tanto")

else:
    print ("carlos es menor")

lucia es mayor pero no tanto

BUCLES FOR

In [35]:
for i in range (0,5):                #for in sirve para crear bucles
    print ("el numero i es:", i)

el numero i es: 0
el numero i es: 1
el numero i es: 2
el numero i es: 3
el numero i es: 4

In [38]:
paises= ["españa", "portugal", "francia", "italia"]

for pais in paises:
    print (pais)

españa
portugal
francia
italia

In [39]:
for pais in paises:
    print (paises)

['españa', 'portugal', 'francia', 'italia']
['españa', 'portugal', 'francia', 'italia']
['españa', 'portugal', 'francia', 'italia']
['españa', 'portugal', 'francia', 'italia']

In [40]:
for key in dicc:
    print (key)

nombre
apellido
pais
DIN
sexo

In [8]:
mail=False
mymail=input ("introduce tu mail:")

for i in mymail:
    if i=="@" or i ==".":
        mail=True

if mail==True:#si no ponemos nada sobreentiende que es verdadero
    print ("el mail es correcto")

else:
    print ("el mail es incorrecto")

introduce tu mail:carlos.gm
el mail es correcto

In [42]:
def fun (a,b):
    x=a-b
    return x
fun (12,4)

8

BASES DE DATOS

In [43]:
import pandas as pd
import numpy as np

In [46]:
tabla=np.array ([[1,3],[5,6],[22,3],[23,81]])
tabla

array([[ 1,  3],
       [ 5,  6],
       [22,  3],
       [23, 81]])

In [47]:
pd.DataFrame (tabla)

    0   1
0   1   3
1   5   6
2  22   3
3  23  81

In [49]:
pd.DataFrame (tabla, index= ["fila 1","fila 2", "fila 3", "fila 4"], columns= ["column 1", "column 2"])

        column 1  column 2
fila 1         1         3
fila 2         5         6
fila 3        22         3
fila 4        23        81

In [53]:
tabla_2= ([2,4], [22,56], [88,34])
tabla_2=pd.DataFrame (tabla_2, index= ["luca","olga", "laura"], columns= ["peso", "altura"])

In [54]:
tabla_2

       peso  altura
luca      2       4
olga     22      56
laura    88      34

In [56]:
paises

['españa', 'portugal', 'francia', 'italia']

In [58]:
población= ["45M", "30M", "50M", "68M"]

dicc2={"paises":paises, "población":población}

dicc2

{'paises': ['españa', 'portugal', 'francia', 'italia'],
 'población': ['45M', '30M', '50M', '68M']}

In [60]:
Tabla_pais_pob=pd.DataFrame (dicc2)
Tabla_pais_pob

     paises población
0    españa       45M
1  portugal       30M
2   francia       50M
3    italia       68M

In [84]:
#importando desde excel

biometricos= "prueba_python.xlsx"
biometricos=pd.read_excel (biometricos)
biometricos

      sexo  edad  peso  altura    IMC
0   hombre    12    38     139  19.67
1   hombre    87    68     168  24.09
2   hombre    17    73     183  21.80
3   hombre    54    75     176  24.21
4   hombre    89    76     178  23.99
5   hombre    23    78     182  23.55
6   hombre    45    79     185  23.08
7   hombre    57    82     183  24.49
8   hombre    57    85     185  24.84
9   hombre    35    86     174  28.41
10  hombre    65    93     178  29.35
11  hombre    75   100     185  29.22
12   mujer    16    48     154  20.24
13   mujer    18    52     161  20.06
14   mujer    44    53     155  22.06
15   mujer    35    54     154  22.77
16   mujer    35    55     166  19.96
17   mujer    55    55     163  20.70
18   mujer    64    55     158  22.03
19   mujer    22    57     163  21.45
20   mujer    43    57     168  20.20
21   mujer    45    61     159  24.13
22   mujer    54    63     173  21.05
23   mujer    65    63     164  23.42
24   mujer    90    63     162  24.01
25   mujer    26    64     163  24.09
26   mujer    47    66     166  23.95
27   mujer    35    70     172  23.66
28   mujer    93    75     165  27.55
29   mujer    63    88     172  29.75

In [71]:
biometricos_h=pd.read_excel(biometricos, 
              sheet_name="Hoja2")

In [72]:
biometricos_m=pd.read_excel(biometricos, 
              sheet_name="Hoja3",
              header=None, #para colocar los nombres de las columnas
              names=["sexo", "edad", "peso", "altura", "IMC"])

In [73]:
biometricos_h

      sexo  edad  peso  altura    IMC
0   hombre    12    38     139  19.67
1   hombre    23    73     183  21.80
2   hombre    23    78     182  23.55
3   hombre    35    86     174  28.41
4   hombre    45    79     185  23.08
5   hombre    54    75     176  24.21
6   hombre    57    82     183  24.49
7   hombre    57    85     185  24.84
8   hombre    65    93     178  29.35
9   hombre    75   100     185  29.22
10  hombre    87    68     168  24.09
11  hombre    89    76     178  23.99

In [74]:
biometricos_m

     sexo  edad  peso  altura    IMC
0   mujer    16    48     154  20.24
1   mujer    33    52     161  20.06
2   mujer    33    57     163  21.45
3   mujer    34    64     163  24.09
4   mujer    35    54     154  22.77
5   mujer    35    55     166  19.96
6   mujer    35    70     172  23.66
7   mujer    43    57     168  20.20
8   mujer    44    53     155  22.06
9   mujer    45    61     159  24.13
10  mujer    47    66     166  23.95
11  mujer    54    63     173  21.05
12  mujer    55    55     163  20.70
13  mujer    63    88     172  29.75
14  mujer    64    55     158  22.03
15  mujer    65    63     164  23.42
16  mujer    90    63     162  24.01
17  mujer    93    75     165  27.55

In [80]:
biometricos_h.head(5)

     sexo  edad  peso  altura    IMC
0  hombre    12    38     139  19.67
1  hombre    23    73     183  21.80
2  hombre    23    78     182  23.55
3  hombre    35    86     174  28.41
4  hombre    45    79     185  23.08

In [81]:
biometricos_m.tail(7)

     sexo  edad  peso  altura    IMC
11  mujer    54    63     173  21.05
12  mujer    55    55     163  20.70
13  mujer    63    88     172  29.75
14  mujer    64    55     158  22.03
15  mujer    65    63     164  23.42
16  mujer    90    63     162  24.01
17  mujer    93    75     165  27.55

In [83]:
biometricos.head(4)

     sexo  edad  peso  altura    IMC
0  hombre    12    38     139  19.67
1  hombre    87    68     168  24.09
2  hombre    17    73     183  21.80
3  hombre    54    75     176  24.21

In [86]:
biometricos.shape

(30, 5)

In [ ]:
pd.set_option("display.max_rows", 30) #util en tablas muy grandes si queremos ver todas las filas. el 30 seria el numeroque quieres ver
biometricos

selección de columnas (una o mas)

In [87]:
biometricos_h["edad"]

0     12
1     23
2     23
3     35
4     45
5     54
6     57
7     57
8     65
9     75
10    87
11    89
Name: edad, dtype: int64

In [88]:
biometricos_h["edad"].head(5)

0    12
1    23
2    23
3    35
4    45
Name: edad, dtype: int64

In [91]:
biometricos_h[["sexo","IMC"]].tail(4)

      sexo    IMC
8   hombre  29.35
9   hombre  29.22
10  hombre  24.09
11  hombre  23.99

In [92]:
biometricos_m[["sexo","IMC", "edad"]].head(6)

    sexo    IMC  edad
0  mujer  20.24    16
1  mujer  20.06    33
2  mujer  21.45    33
3  mujer  24.09    34
4  mujer  22.77    35
5  mujer  19.96    35

añadir nuevas columnas

In [93]:
biometricos_m ["% grasa"]=25
biometricos_m.head(5)

    sexo  edad  peso  altura    IMC  % grasa
0  mujer    16    48     154  20.24       25
1  mujer    33    52     161  20.06       25
2  mujer    33    57     163  21.45       25
3  mujer    34    64     163  24.09       25
4  mujer    35    54     154  22.77       25

In [94]:
len (biometricos_m)

18

In [98]:
np.arange (0,18)
belleza=(np.arange (0,18))
biometricos_m ["belleza"]=belleza

biometricos_m.tail(5)

     sexo  edad  peso  altura    IMC  % grasa  belleza
13  mujer    63    88     172  29.75       25       13
14  mujer    64    55     158  22.03       25       14
15  mujer    65    63     164  23.42       25       15
16  mujer    90    63     162  24.01       25       16
17  mujer    93    75     165  27.55       25       17

In [101]:
np.random.randint(1,50, size=18)
aleatorio= (np.random.randint(1,50, size=18))
biometricos_m ["aleatorio"]=aleatorio
biometricos_m.head(6)

    sexo  edad  peso  altura    IMC  % grasa  belleza  aleatorio
0  mujer    16    48     154  20.24       25        0          5
1  mujer    33    52     161  20.06       25        1         31
2  mujer    33    57     163  21.45       25        2         21
3  mujer    34    64     163  24.09       25        3         28
4  mujer    35    54     154  22.77       25        4          2
5  mujer    35    55     166  19.96       25        5         20

In [102]:
np.random.uniform(1,30, size=12)
aleatorio_h= (np.random.uniform(1,30, size=12))
biometricos_h ["aleatorio_h"]=aleatorio_h
biometricos_h.head(6)

     sexo  edad  peso  altura    IMC  aleatorio_h
0  hombre    12    38     139  19.67    24.854773
1  hombre    23    73     183  21.80    16.859234
2  hombre    23    78     182  23.55    24.759874
3  hombre    35    86     174  28.41    17.799389
4  hombre    45    79     185  23.08    29.552949
5  hombre    54    75     176  24.21    14.176834

In [103]:
round (biometricos_h, 2)

      sexo  edad  peso  altura    IMC  aleatorio_h
0   hombre    12    38     139  19.67        24.85
1   hombre    23    73     183  21.80        16.86
2   hombre    23    78     182  23.55        24.76
3   hombre    35    86     174  28.41        17.80
4   hombre    45    79     185  23.08        29.55
5   hombre    54    75     176  24.21        14.18
6   hombre    57    82     183  24.49        18.23
7   hombre    57    85     185  24.84        25.11
8   hombre    65    93     178  29.35        23.60
9   hombre    75   100     185  29.22         9.24
10  hombre    87    68     168  24.09        13.67
11  hombre    89    76     178  23.99        28.89

In [111]:
biometricos_h.pop("aleatorio_h")
biometricos_h

      sexo  edad  peso  altura
0   hombre    12    38     139
1   hombre    23    73     183
2   hombre    23    78     182
3   hombre    35    86     174
4   hombre    45    79     185
5   hombre    54    75     176
6   hombre    57    82     183
7   hombre    57    85     185
8   hombre    65    93     178
9   hombre    75   100     185
10  hombre    87    68     168
11  hombre    89    76     178

Operaciones con bases de datos

In [112]:
biometricos.describe()

            edad        peso      altura        IMC
count  30.000000   30.000000   30.000000  30.000000
mean   48.866667   67.733333  168.466667  23.592667
std    23.298266   14.548216   11.202627   2.863546
min    12.000000   38.000000  139.000000  19.670000
25%    35.000000   55.500000  162.250000  21.537500
50%    46.000000   65.000000  167.000000  23.605000
75%    63.750000   77.500000  177.500000  24.190000
max    93.000000  100.000000  185.000000  29.750000

In [118]:
print (biometricos["edad"].mean())
print (biometricos["altura"].std())
print (biometricos["IMC"].max())
print (biometricos["edad"].min())

48.86666666666667
11.202626949725348
29.75
12

In [120]:
biometricos["edad"].sum()

1466

In [121]:
biometricos["IMC"].sum()

707.78

In [122]:
biometricos["edad"]+biometricos["IMC"]+biometricos["altura"]

0     170.67
1     279.09
2     221.80
3     254.21
4     290.99
5     228.55
6     253.08
7     264.49
8     266.84
9     237.41
10    272.35
11    289.22
12    190.24
13    199.06
14    221.06
15    211.77
16    220.96
17    238.70
18    244.03
19    206.45
20    231.20
21    228.13
22    248.05
23    252.42
24    276.01
25    213.09
26    236.95
27    230.66
28    285.55
29    264.75
dtype: float64

In [123]:
biometricos["edad"]+biometricos["IMC"]+biometricos["altura"]/3

0      78.003333
1     167.090000
2      99.800000
3     136.876667
4     172.323333
5     107.216667
6     129.746667
7     142.490000
8     143.506667
9     121.410000
10    153.683333
11    165.886667
12     87.573333
13     91.726667
14    117.726667
15    109.103333
16    110.293333
17    130.033333
18    138.696667
19     97.783333
20    119.200000
21    122.130000
22    132.716667
23    143.086667
24    168.010000
25    104.423333
26    126.283333
27    115.993333
28    175.550000
29    150.083333
dtype: float64

In [125]:
biometricos["media biom"]=biometricos["edad"]+biometricos["IMC"]+biometricos["altura"]/3

biometricos.head(5)

     sexo  edad  peso  altura    IMC  media biom
0  hombre    12    38     139  19.67   78.003333
1  hombre    87    68     168  24.09  167.090000
2  hombre    17    73     183  21.80   99.800000
3  hombre    54    75     176  24.21  136.876667
4  hombre    89    76     178  23.99  172.323333

In [131]:
biometricos=biometricos.round (3)
biometricos.tail (3)

     sexo  edad  peso  altura    IMC  media biom
27  mujer    35    70     172  23.66     115.993
28  mujer    93    75     165  27.55     175.550
29  mujer    63    88     172  29.75     150.083

contabilizar valores

In [133]:
biometricos["edad"].count()

30

In [134]:
biometricos["sexo"].value_counts()

mujer     18
hombre    12
Name: sexo, dtype: int64

In [135]:
biometricos["sexo"].value_counts(normalize=True)

mujer     0.6
hombre    0.4
Name: sexo, dtype: float64

clasificar datos

In [137]:
biometricos_h.sort_values("altura")

      sexo  edad  peso  altura
0   hombre    12    38     139
10  hombre    87    68     168
3   hombre    35    86     174
5   hombre    54    75     176
8   hombre    65    93     178
11  hombre    89    76     178
2   hombre    23    78     182
1   hombre    23    73     183
6   hombre    57    82     183
4   hombre    45    79     185
7   hombre    57    85     185
9   hombre    75   100     185

In [138]:
biometricos_h.sort_values("altura", ascending=False)

      sexo  edad  peso  altura
4   hombre    45    79     185
7   hombre    57    85     185
9   hombre    75   100     185
1   hombre    23    73     183
6   hombre    57    82     183
2   hombre    23    78     182
8   hombre    65    93     178
11  hombre    89    76     178
5   hombre    54    75     176
3   hombre    35    86     174
10  hombre    87    68     168
0   hombre    12    38     139

In [139]:
biometricos_h.sort_values (["altura","edad"])

      sexo  edad  peso  altura
0   hombre    12    38     139
10  hombre    87    68     168
3   hombre    35    86     174
5   hombre    54    75     176
8   hombre    65    93     178
11  hombre    89    76     178
2   hombre    23    78     182
1   hombre    23    73     183
6   hombre    57    82     183
4   hombre    45    79     185
7   hombre    57    85     185
9   hombre    75   100     185

In [140]:
biometricos_h

      sexo  edad  peso  altura
0   hombre    12    38     139
1   hombre    23    73     183
2   hombre    23    78     182
3   hombre    35    86     174
4   hombre    45    79     185
5   hombre    54    75     176
6   hombre    57    82     183
7   hombre    57    85     185
8   hombre    65    93     178
9   hombre    75   100     185
10  hombre    87    68     168
11  hombre    89    76     178

In [141]:
biometricos_h.sort_values (["altura","edad"], inplace=True)
biometricos_h

      sexo  edad  peso  altura
0   hombre    12    38     139
10  hombre    87    68     168
3   hombre    35    86     174
5   hombre    54    75     176
8   hombre    65    93     178
11  hombre    89    76     178
2   hombre    23    78     182
1   hombre    23    73     183
6   hombre    57    82     183
4   hombre    45    79     185
7   hombre    57    85     185
9   hombre    75   100     185